{
   "Functionality": {
      "Exceptional": "2 of the additional features in Iteration 4 are complete",
      "Meets Expectations": "All of the functionality in Iteration 3 is complete",
      "Below Expectations": "Some of the functionality in Iteration 3 is not complete",
      "Well Below Expectations": "Some of the functionality in Iterations 1 or 2 is not complete"
   },
   "Object Oriented Programming": {
      "Exceptional": "Project includes at least one additional class not outlined in the spec that does no command line input or output, adheres to SRP, and acts as a crucial piece in the function of the program",
      "Meets Expectations": "Project includes at least one additional class not outlined in the spec contained in its own file with no executable code outside the class. Very little code is not contained within a class.",
      "Below Expectations": "Project includes at least one additional class not outlined in the spec. Code that is crucial to the setup, play, or end of a game may not be contained in a class",
      "Well Below Expectations": "Project does not include a class not outlined in the spec. The project does not use the required objects appropriately to accomplish the task."
   },
   "Test Driven Development": {
      "Exceptional": "All methods throughout the project are fully unit and integration tested, including additional classes built in Iterations 3 or 4. No tests fail to accurately verify expected behavior.",
      "Meets Expectations": "No more than 2 tests fail to accurately verify expected behavior. All methods that do not rely on CLI are unit and integration tested.",
      "Below Expectations": "Every method from iteration 1 or 2 does not include a test. More than 2 tests fail to accurately verify expected behavior.",
      "Well Below Expectations": "Half the methods throughout the project are not tested or have tests that do not accurately verify expected behavior"
   },
   "Version Control": {
      "Exceptional": "Project includes at least 10 pull requests that include helpful comments from both partners and were not merged by the author",
      "Meets Expectations": "Project includes at least 10 pull requests and 30 commits. Insights show that one partner contributed no more than twice as much as the other in terms of lines of code or commits.",
      "Below Expectations": "Project includes at least 5 pull requests and 20 commits",
      "Well Below Expectations": "Project has 5 or fewer pull requests or less than 20 commits"
   }
}