[
 {
   "": "Functionality",
   "Exceptional": "Application is robust and can handle a variety of inputs including invalid inputs and completes iteration 4",
   "Meets Expectations": "Application adheres to the flow outlined in the specification and can handle a variety of valid inputs (not just what is outlined in spec). Iteration 3 is complete.",
   "Below Expectations": "Only up to Iteration 2 is complete or the application does not follow the flow outlined in the specification.",
   "Well Below Expectations": "Iteration 2 is not complete."
 },
 {
   "": "Ruby Mechanics",
   "Exceptional": "Project includes appropriate uses of hashes and enumerables not covered in class",
   "Meets Expectations": "Appropriately uses Ruby’s built in datatypes and methods, flow control, and enumerables.",
   "Below Expectations": "Does not appropriately use one or two of the following: Ruby’s built in datatypes and methods, flow control, and enumerables",
   "Well Below Expectations": "Does not appropriately use Ruby’s built in datatypes and methods, flow control, and enumerables, or does not build classes"
 },
 {
   "": "Ruby Conventions",
   "Exceptional": "Classes, methods, and variables are well named so that they clearly communicate their purpose. Code is all properly indented and syntax is consistent.",
   "Meets Expectations": "Code is mostly properly indented, spaced, and lines are not excessively long. Class, method, variable, and file names follow convention",
   "Below Expectations": "Code demonstrates some proper indenting and spacing. Class, method, variable, and file names inconsistently follow convention",
   "Well Below Expectations": "Code is not properly indented and spaced and lines are excessively long. Class, method, variable, and file names do not follow convention"
 },
 {
   "": "Testing",
   "Exceptional": "All methods that do not require command line input/output are accurately tested. Best use assertions are made.",
   "Meets Expectations": "Each class has its own test file. Every method listed on the specification is tested. Most tests are written to accurately verify expected behavior.",
   "Below Expectations": "Tests are written for most methods listed on the specification, but the tests may be in an incorrect location or the tests may not accurately verify the expected behavior",
   "Well Below Expectations": "Fewer than 7 tests written (in addition to the card tests provided)"
 }
]